IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZ_BUZZ.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CNT PIC 9(3) VALUE 0.
01 MOD3 PIC 9(1) VALUE 0.
01 MOD5 PIC 9(1) VALUE 0.
PROCEDURE DIVISION.
PERFORM VARYING CNT FROM 1 BY 1 UNTIL CNT > 100
  COMPUTE MOD3 = FUNCTION MOD(CNT 3)
  COMPUTE MOD5 = FUNCTION MOD(CNT 5)
  IF MOD3 = 0 AND MOD5 = 0
    DISPLAY "FizzBuzz"
  ELSE IF MOD3 = 0
    DISPLAY "Fizz"
  ELSE IF MOD5 = 0
    DISPLAY "Buzz"
  ELSE
    DISPLAY CNT
  END-IF
END-PERFORM.
